vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1165_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1165_system"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm4.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm4.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm4.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm4.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm4.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm4.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm7.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm7.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm7.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1165_header"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.adc_etc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.anadig_pmu.condition_id">
      <require condition="allOf.device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.anatop_ai.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.aoi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.asrc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.asrc_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.asrc, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.asrc, device=MIMXRT1165.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="asrc"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.caam.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.cache_armv7_m7.condition_id">
      <require condition="allOf.core=cm7f, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm7f, device=MIMXRT1165.internal_condition">
      <require condition="core.cm7f.internal_condition"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="core.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="driver.cache_lmem.condition_id">
      <require condition="allOf.core=cm4f, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm4f, device=MIMXRT1165.internal_condition">
      <require condition="core.cm4f.internal_condition"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="core.cm4f.internal_condition">
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
