vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1165_DFP.pdsc
    <condition id="allOf.driver.common, driver.mipi_csi2rx_soc, driver.mipi_dsi_soc, device_id=MIMXRT1165xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi"/>
      <require condition="device_id.MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.mu.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.nic301.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.ocotp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1165.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pdm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.pdm_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.pdm, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.pdm, device=MIMXRT1165.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pdm"/>
      <require condition="device.MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pgmc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.puf.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.qtmr_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.rdc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.rdc_sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1165.internal_condition"/>
    </condition>
    <condition id="driver.rtwdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1165xxxxx.internal_condition"/>
    </condition>
